# Wczytanie pliku modelu
    read_verilog -sv subtract.sv

# Utworzenie kopi modulu z inna nazwa
    copy subtract subtract_rtl

# Ustawienie hierarchii projektu na nowy modul 
    hierarchy -top subtract_rtl

# Synteza logiczna
    synth

# Mapowanie na bramki
    abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
    opt_clean

# Zapis wyniku symulacji
    write_verilog -noattr subtract_rtl.sv
    
# Wypisanie statystyki uzytych bramek
    stat -tech cmos